Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetUserPropertyItems Method
 Returns an enumerator of all user property items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserPropertyItemEnumerator GetUserPropertyItems()
Public Function GetUserPropertyItems As UserPropertyItemEnumerator
Return Value
Type: UserPropertyItemEnumerator
A UserPropertyItemEnumerator of all user property items.
See Also
Reference
CatalogHandler Class
GetUserPropertyItems Overload
Tekla.Structures.Catalogs Namespace